In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({'a' : [1, 2, 3, 4, 5]})

In [5]:
df

   a
0  1
1  2
2  3
3  4
4  5

In [6]:
df['b'] = 0

In [7]:
def case_function(x) :
    if x < 2 :
        return '2미만'
    elif x < 4 :
        return '4미만'
    else :
        return '4이상'

In [9]:
df['c'] = df['a'].apply(case_function)

In [10]:
df

   a  b    c
0  1  0  2미만
1  2  0  4미만
2  3  0  4미만
3  4  0  4이상
4  5  0  4이상

In [11]:
a = { 1 : 'one', 2 : 'two', 3 : 'three', 4 : 'four', 5 : 'five'}

In [14]:
df['d'] = df['a'].map(a)

In [15]:
df

   a  b    c      d
0  1  0  2미만    one
1  2  0  4미만    two
2  3  0  4미만  three
3  4  0  4이상   four
4  5  0  4이상   five